<a href="https://colab.research.google.com/github/anew0m/AStudy_Pandas-basic/blob/main/study/07_Reshaping_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 07_Reshaping Data

## 11) df.sort_values, rename, sort_index, reset_index로 데이터 프레임 Reshaping 하기

In [5]:
import pandas as pd
import numpy as np
import seaborn as sns

In [6]:
df = pd.DataFrame([])

In [7]:
df.sort_values?

In [10]:
df = sns.load_dataset("mpg")
df

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
393  27.0          4  ...     usa            ford mustang gl
394  44.0          4  ...  europe                  vw pickup
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[398 rows x 9 columns]

In [11]:
df.shape

(398, 9)

In [12]:
df.head()

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst
4  17.0          8         302.0  ...          70     usa                ford torino

[5 rows x 9 columns]

In [18]:
df.sort_values('mpg').head()

      mpg  cylinders  displacement  ...  model_year  origin              name
28    9.0          8         304.0  ...          70     usa          hi 1200d
25   10.0          8         360.0  ...          70     usa         ford f250
26   10.0          8         307.0  ...          70     usa         chevy c20
103  11.0          8         400.0  ...          73     usa  chevrolet impala
124  11.0          8         350.0  ...          73     usa  oldsmobile omega

[5 rows x 9 columns]

In [17]:
df.sort_values('mpg', ascending = False).head()

      mpg  cylinders  displacement  ...  model_year  origin                  name
322  46.6          4          86.0  ...          80   japan             mazda glc
329  44.6          4          91.0  ...          80   japan   honda civic 1500 gl
325  44.3          4          90.0  ...          80  europe  vw rabbit c (diesel)
394  44.0          4          97.0  ...          82  europe             vw pickup
326  43.4          4          90.0  ...          80  europe    vw dasher (diesel)

[5 rows x 9 columns]

In [19]:
df.sort_values('mpg', ascending = False, na_position = 'first').head()

      mpg  cylinders  displacement  ...  model_year  origin                  name
322  46.6          4          86.0  ...          80   japan             mazda glc
329  44.6          4          91.0  ...          80   japan   honda civic 1500 gl
325  44.3          4          90.0  ...          80  europe  vw rabbit c (diesel)
394  44.0          4          97.0  ...          82  europe             vw pickup
326  43.4          4          90.0  ...          80  europe    vw dasher (diesel)

[5 rows x 9 columns]

In [20]:
df.rename?

In [23]:
df.rename(columns = {'model_year' : 'year'}).head()

    mpg  cylinders  displacement  ...  year  origin                       name
0  18.0          8         307.0  ...    70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...    70     usa          buick skylark 320
2  18.0          8         318.0  ...    70     usa         plymouth satellite
3  16.0          8         304.0  ...    70     usa              amc rebel sst
4  17.0          8         302.0  ...    70     usa                ford torino

[5 rows x 9 columns]

In [22]:
df.head()

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst
4  17.0          8         302.0  ...          70     usa                ford torino

[5 rows x 9 columns]

In [24]:
df = df.rename(columns = {'model_year' : 'year'})

In [26]:
df.head()

    mpg  cylinders  displacement  ...  year  origin                       name
0  18.0          8         307.0  ...    70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...    70     usa          buick skylark 320
2  18.0          8         318.0  ...    70     usa         plymouth satellite
3  16.0          8         304.0  ...    70     usa              amc rebel sst
4  17.0          8         302.0  ...    70     usa                ford torino

[5 rows x 9 columns]

In [27]:
df.sort_index()

      mpg  cylinders  displacement  ...  year  origin                       name
0    18.0          8         307.0  ...    70     usa  chevrolet chevelle malibu
1    15.0          8         350.0  ...    70     usa          buick skylark 320
2    18.0          8         318.0  ...    70     usa         plymouth satellite
3    16.0          8         304.0  ...    70     usa              amc rebel sst
4    17.0          8         302.0  ...    70     usa                ford torino
..    ...        ...           ...  ...   ...     ...                        ...
393  27.0          4         140.0  ...    82     usa            ford mustang gl
394  44.0          4          97.0  ...    82  europe                  vw pickup
395  32.0          4         135.0  ...    82     usa              dodge rampage
396  28.0          4         120.0  ...    82     usa                ford ranger
397  31.0          4         119.0  ...    82     usa                 chevy s-10

[398 rows x 9 columns]

In [28]:
df.reset_index().head()

   index   mpg  cylinders  ...  year  origin                       name
0      0  18.0          8  ...    70     usa  chevrolet chevelle malibu
1      1  15.0          8  ...    70     usa          buick skylark 320
2      2  18.0          8  ...    70     usa         plymouth satellite
3      3  16.0          8  ...    70     usa              amc rebel sst
4      4  17.0          8  ...    70     usa                ford torino

[5 rows x 10 columns]

In [29]:
df.reset_index?

In [32]:
df.drop(columns = ['mpg', 'year', 'name'])

     cylinders  displacement  horsepower  weight  acceleration  origin
0            8         307.0       130.0    3504          12.0     usa
1            8         350.0       165.0    3693          11.5     usa
2            8         318.0       150.0    3436          11.0     usa
3            8         304.0       150.0    3433          12.0     usa
4            8         302.0       140.0    3449          10.5     usa
..         ...           ...         ...     ...           ...     ...
393          4         140.0        86.0    2790          15.6     usa
394          4          97.0        52.0    2130          24.6  europe
395          4         135.0        84.0    2295          11.6     usa
396          4         120.0        79.0    2625          18.6     usa
397          4         119.0        82.0    2720          19.4     usa

[398 rows x 6 columns]

In [33]:
df = df.drop(columns = ['mpg', 'year', 'name'])

In [34]:
df

     cylinders  displacement  horsepower  weight  acceleration  origin
0            8         307.0       130.0    3504          12.0     usa
1            8         350.0       165.0    3693          11.5     usa
2            8         318.0       150.0    3436          11.0     usa
3            8         304.0       150.0    3433          12.0     usa
4            8         302.0       140.0    3449          10.5     usa
..         ...           ...         ...     ...           ...     ...
393          4         140.0        86.0    2790          15.6     usa
394          4          97.0        52.0    2130          24.6  europe
395          4         135.0        84.0    2295          11.6     usa
396          4         120.0        79.0    2625          18.6     usa
397          4         119.0        82.0    2720          19.4     usa

[398 rows x 6 columns]

## 12) melt, pivot 으로 Tidy Data 만들기

In [36]:
import pandas as pd

In [37]:
pd.melt?

In [38]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [39]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [40]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [41]:
pd.melt(df, value_vars=['A', 'B', 'C'])

  variable value
0        A     a
1        A     b
2        A     c
3        B     1
4        B     3
5        B     5
6        C     2
7        C     4
8        C     6

In [42]:
pd.melt(df, value_vars=['A', 'B', 'C']).rename(columns = {
    'variable' : 'var', 
    'value' : 'val'
    })

  var val
0   A   a
1   A   b
2   A   c
3   B   1
4   B   3
5   B   5
6   C   2
7   C   4
8   C   6

In [43]:
pd.melt(df, value_vars=['A', 'B', 'C']).rename(columns = {
    'variable' : 'var', 
    'value' : 'val'
    }).head()

  var val
0   A   a
1   A   b
2   A   c
3   B   1
4   B   3

In [44]:
df.pivot?

In [48]:
df2 = pd.DataFrame({
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6], 
                   'foo': ['one', 'one', 'one', 'two', 'two', 'two']
                    })
df2

  bar  baz  foo
0   A    1  one
1   B    2  one
2   C    3  one
3   A    4  two
4   B    5  two
5   C    6  two

In [50]:
df2.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [51]:
df2.pivot(index='foo', columns='bar', values='baz').reset_index()

bar  foo  A  B  C
0    one  1  2  3
1    two  4  5  6

In [52]:
df3 = df2.pivot(index='foo', columns='bar', values='baz').reset_index()

In [53]:
df3

bar  foo  A  B  C
0    one  1  2  3
1    two  4  5  6

In [54]:
df3.melt?

In [55]:
df3.melt(id_vars=['foo'], value_vars=['A', 'B', 'C'])

   foo bar  value
0  one   A      1
1  two   A      4
2  one   B      2
3  two   B      5
4  one   C      3
5  two   C      6

In [58]:
df3.melt(id_vars=['foo'], value_vars=['A', 'B', 'C']).sort_values(['foo', 'bar'])

   foo bar  value
0  one   A      1
2  one   B      2
4  one   C      3
1  two   A      4
3  two   B      5
5  two   C      6

In [59]:
df3.melt(id_vars=['foo'], value_vars=['A', 'B', 'C']).sort_values(['foo', 'bar']).rename(columns = {
    'value' : 'baz'
})

   foo bar  baz
0  one   A    1
2  one   B    2
4  one   C    3
1  two   A    4
3  two   B    5
5  two   C    6

In [60]:
df2

  bar  baz  foo
0   A    1  one
1   B    2  one
2   C    3  one
3   A    4  two
4   B    5  two
5   C    6  two

## 13) pd.concat([df1,df2]) 시리즈, 데이터프레임 합치기

In [61]:
import pandas as pd

In [63]:
pd.concat?

In [64]:
# pd.concat([df1, df2])

In [66]:
s1 = pd.Series(['a', 'b'])
s1

0    a
1    b
dtype: object

In [67]:
s2 = pd.Series(['c', 'd'])
s2

0    c
1    d
dtype: object

In [68]:
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [69]:
pd.concat([s1, s2], ignore_index = True)

0    a
1    b
2    c
3    d
dtype: object

In [70]:
pd.concat([s1, s2], keys = ['s1', 's2',])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [71]:
 pd.concat([s1, s2], keys=['s1', 's2'], names=['Series name', 'Row ID'])

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

In [73]:
df1 = pd.DataFrame([['a', 1], ['b', 2]], columns=['letter', 'number'])
df1

  letter  number
0      a       1
1      b       2

In [75]:
df2 = pd.DataFrame([['c', 3], ['d', 4]], columns=['letter', 'number'])
df2

  letter  number
0      c       3
1      d       4

In [76]:
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [77]:
pd.concat([df1, df2], ignore_index=True)

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

In [78]:
df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                   columns=['letter', 'number', 'animal'])
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

In [79]:
pd.concat([df1, df3])

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [80]:
pd.concat([df1, df3], join = "inner")

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [82]:
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
                   columns=['animal', 'name'])
df4

   animal    name
0    bird   polly
1  monkey  george

In [83]:
pd.concat([df1, df4], axis=1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

In [86]:
df5 = pd.DataFrame([1], index=['a'])
df5

   0
a  1

In [87]:
df6 = pd.DataFrame([2], index=['a'])
df6

   0
a  2

In [88]:
pd.concat([df5, df6], verify_integrity=True)

ValueError: ignored

In [89]:
pd.concat([df5, df6])

   0
a  1
a  2